nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/source/common/ble_service_discovery.c
                        gattCharacteristic_t *pCurrentChar    =
                                                 pCurrentService->aCharacteristics +
                                                 pInfo->mCurrentCharInDiscoveryIndex;

                        pInfo->mCurrentDescInDiscoveryIndex +=
                                                 pCurrentChar->cNumDescriptors;

                        /* Move on to the next characteristic */
                        pInfo->mCurrentCharInDiscoveryIndex++;
                    }

                    gattService_t *pCurrentService =
                                                 pInfo->mpServiceDiscoveryBuffer +
                                                 pInfo->mCurrentServiceInDiscoveryIndex;

                    if (pInfo->mCurrentCharInDiscoveryIndex < pCurrentService->cNumCharacteristics)
                    {
                        gattCharacteristic_t *pCurrentChar =
                                                 pCurrentService->aCharacteristics +
                                                 pInfo->mCurrentCharInDiscoveryIndex;

                        /* Find next characteristic with descriptors*/
                        while (pInfo->mCurrentCharInDiscoveryIndex < pCurrentService->cNumCharacteristics - 1U)
                        {
#if defined(gBLE51_d) && (gBLE51_d == 1U) && defined(gGattCaching_d) && (gGattCaching_d == 1U)
                             /* save the handle for the client supported features characteristic */
                             if ((pCurrentChar->value.uuid.uuid16 == gBleSig_GattClientSupportedFeatures_d) && (gBleAppMaxActiveConnectionsGattCaching_c > 0U))
                             {
                                 gGattActiveClientSupportedFeaturesHandles[peerDeviceId] = pCurrentChar->value.handle - 1;
                             }

                             /* save the handle for the service changed characteristic */
                             if ((pCurrentChar->value.uuid.uuid16 == gBleSig_GattServiceChanged_d) && (gBleAppMaxActiveConnectionsGattCaching_c > 0U))
                             {
                                 mActiveServiceChangedCharHandle[peerDeviceId] = pCurrentChar->value.handle - 1;
                             }
#endif /* gBLE51_d && gGattCaching_d */
                            /* Check if we have handles available between adjacent characteristics */
                            if (pCurrentChar->value.handle + 2U < (pCurrentChar + 1)->value.handle)
                            {
                                if (pInfo->mCurrentDescInDiscoveryIndex < (uint8_t)gMaxCharDescriptorsCount_d)
                                {
                                    pCurrentChar->aDescriptors = pInfo->mpCharDescriptorBuffer +
                                                                 pInfo->mCurrentDescInDiscoveryIndex;
                                    (void)GattClient_DiscoverAllCharacteristicDescriptors(
                                                        peerDeviceId,
                                                        pCurrentChar,
                                                        (pCurrentChar + 1)->value.handle,
                                                        (uint8_t)(gMaxCharDescriptorsCount_d -
                                                        pInfo->mCurrentDescInDiscoveryIndex));
                                    return;
                                }
                            }

                            pInfo->mCurrentCharInDiscoveryIndex++;
                            pCurrentChar = pCurrentService->aCharacteristics +
                                           pInfo->mCurrentCharInDiscoveryIndex;
                        }

                        /* Made it to the last characteristic. Check against service end handle*/
                        if (pCurrentChar->value.handle < pCurrentService->endHandle)
                        {
                            if (pInfo->mCurrentDescInDiscoveryIndex < gMaxCharDescriptorsCount_d)
                            {
                                pCurrentChar->aDescriptors = pInfo->mpCharDescriptorBuffer +
                                                             pInfo->mCurrentDescInDiscoveryIndex;
                                (void)GattClient_DiscoverAllCharacteristicDescriptors(
                                                        peerDeviceId,
                                                        pCurrentChar,
                                                        pCurrentService->endHandle,
                                                        (uint8_t)(gMaxCharDescriptorsCount_d -
                                                        pInfo->mCurrentDescInDiscoveryIndex));
                                return;
                            }

                        }
                    }

                    /* Signal Discovery of Service */
                    BleServDisc_NewService(peerDeviceId, pCurrentService);

                    /* Move on to the next service */
                    pInfo->mCurrentServiceInDiscoveryIndex++;

                    /* Reset characteristic discovery */
                    pInfo->mCurrentCharInDiscoveryIndex = 0;
                    pInfo->mCurrentDescInDiscoveryIndex = 0;
                    FLib_MemSet(pInfo->mpCharDescriptorBuffer,
                                0,
                                sizeof(gattAttribute_t) * (uint32_t)gMaxCharDescriptorsCount_d);
                    FLib_MemSet(pInfo->mpCharDiscoveryBuffer,
                                0,
                                sizeof(gattCharacteristic_t) * (uint32_t)gMaxServiceCharCount_d);

                    if (pInfo->mCurrentServiceInDiscoveryIndex < pInfo->mcPrimaryServices)
                    {
                        /* Allocate memory for Char Discovery */
                        (pInfo->mpServiceDiscoveryBuffer + pInfo->mCurrentServiceInDiscoveryIndex)->aCharacteristics =
                                                               pInfo->mpCharDiscoveryBuffer;

                         /* Start Characteristic Discovery for current service */
                        (void)GattClient_DiscoverAllCharacteristicsOfService(
                                peerDeviceId,
                                pInfo->mpServiceDiscoveryBuffer + pInfo->mCurrentServiceInDiscoveryIndex,
                                gMaxServiceCharCount_d);
                    }
                    else
                    {
#if defined(gBLE51_d) && (gBLE51_d == 1U) && defined(gGattCaching_d) && (gGattCaching_d == 1U) \
    && defined(gGattAutomaticRobustCachingSupport_d) && (gGattAutomaticRobustCachingSupport_d == 1U)
                        /* use a dummy nvm index to know when the function is called at the end of service discovery */
                        (void)GattClient_GetDatabaseHash(peerDeviceId, gInvalidNvmIndex_c);
#else
                        BleServDisc_Finished(peerDeviceId, TRUE);
#endif /* gGattCaching_d && gBLE51_d */
                    }
                }
                break;

                default:
                {
                    ; /* No action required */
                }
                break;
            }
        }
    }
}

/*! *********************************************************************************
* \brief    Stops the Service Discovery procedure with the peer device.
*
* \param[in] peerDeviceId      The GAP peer Id
*
* \param[in] result            The result (true or false)
*
* \return none
*
********************************************************************************** */
void BleServDisc_Finished(deviceId_t peerDeviceId, bool_t result)
{
    servDiscEvent_t event;

    BleServDisc_Stop(peerDeviceId);
    event.eventType = gDiscoveryFinished_c;
    event.eventData.success = result;
    pfServDiscCallback(peerDeviceId, &event);
}

/************************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
************************************************************************************/

/*! *********************************************************************************
*\private
*\fn           void BleServDisc_Reset(deviceId_t peerDeviceId)
*\brief        Frees the memory that has been allocated for Service Discovery.
*
*\param  [in]  peerDeviceId        GATT Server device ID.

